Repository: chevybowtie/K-Ollama-Plasmoid
Catalog: po/*.po
Languages: es

# @title
source: Appearance & Behavior
es: Apariencia y comportamiento

# @title
source: Server
es: Servidor

# @label:textbox
source: Ollama Server URL:
es: URL del servidor Ollama:

# @info:tooltip
source: URL of the Ollama server. Use localhost (127.0.0.1) for local server or LAN IP for remote server
es: URL del servidor Ollama. Use localhost (127.0.0.1) para servidor local o IP de LAN para servidor remoto

# @info
source: Examples: • Local server: http://127.0.0.1:11434 • Remote server: http://192.168.1.100:11434
es: Ejemplos: • Servidor local: http://127.0.0.1:11434 • Servidor remoto: http://192.168.1.100:11434

# @label
source: Temperature
es: Temperatura

# @info
source: Lower = more deterministic, higher = more creative (0.0–2.0)
es: Menor = más determinista, mayor = más creativo (0.0–2.0)

# @label:checkbox
source: System prompt
es: Indicación del sistema

# @option
source: Enable system prompt
es: Habilitar indicación del sistema

# @info
source: Prepend a system message to every API request. Do not include secrets.
es: Antepone un mensaje del sistema a cada solicitud de API. No incluya secretos.

# @info:placeholder
source: You are a helpful assistant that answers questions in plain English.
es: Eres un asistente útil que responde preguntas en español sencillo.

# @info
source: Long prompts may increase request size.
es: Las indicaciones largas pueden aumentar el tamaño de la solicitud.

# @title:group
source: Icon:
es: Icono:

# @option:radio
source: Filled adaptive icon
es: Icono adaptativo relleno

# @option:radio
source: Outlined adaptive icon
es: Icono adaptativo contorneado

# @option:radio
source: Filled dark icon
es: Icono oscuro relleno

# @option:radio
source: Filled light icon
es: Icono claro relleno

# @option:radio
source: Outlined dark icon
es: Icono oscuro contorneado

# @option:radio
source: Outlined light icon
es: Icono claro contorneado

# @label:checkbox
source: Input behavior:
es: Comportamiento de entrada:

# @option:check
source: Use Enter to send message
es: Usar Enter para enviar mensaje

# @info:tooltip
source: When enabled: Enter sends message, Ctrl+Enter adds new line. When disabled: Enter adds new line, use `send` button to submit.
es: Cuando está habilitado: Enter envía el mensaje, Ctrl+Enter añade nueva línea. Cuando está deshabilitado: Enter añade nueva línea, usa el botón `enviar` para mandar.

# @label:checkbox
source: Sound effects:
es: Efectos de sonido:

# @option:check
source: Play sound when AI response is complete
es: Reproducir sonido cuando la respuesta de IA esté completa

# @info:tooltip
source: Play a slight beep sound effect after the response is completed.
es: Reproduce un ligero sonido de pitido después de que la respuesta esté completada.

# @label:checkbox
source: Text rendering:
es: Renderizado de texto:

# @option:check
source: Enable markdown rendering in AI responses
es: Habilitar renderizado de markdown en respuestas de IA

# @info:tooltip
source: Render markdown formatting (bold, italics, code blocks, etc.) in AI responses. When disabled, responses are shown as plain text.
es: Renderiza el formato markdown (negrita, cursiva, bloques de código, etc.) en las respuestas de IA. Cuando está deshabilitado, las respuestas se muestran como texto plano.

# @label:checkbox
source: Debug logging:
es: Registro de depuración:

# @option:check
source: Enable debug console logs
es: Habilitar registros de consola de depuración

# @info:tooltip
source: Show debug console.log messages for troubleshooting. This setting is persisted.
es: Muestra mensajes de console.log de depuración para solución de problemas. Esta configuración se mantiene persistente.
